a52dec
acl
acpi
adobe-source-code-pro-fonts
adobe-source-han-sans-cn-fonts
adobe-source-han-serif-cn-fonts
adwaita-icon-theme
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
aom
archlinux-keyring
argon2
aspell
at-spi2-atk
at-spi2-core
atk
atool
attica
attr
audiofile
audit
autoconf
autojump
automake
avahi
babl
base
bash
bash-completion
bc
bcg729
binutils
bison
bluez
bluez-libs
bluez-utils
boost
boost-libs
botan
bridge-utils
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cantarell-fonts
cblas
cdparanoia
ceph-libs
cifs-utils
clang
clucene
cmus
cni-plugins
colord
colordiff
compiler-rt
conmon
conntrack-tools
containerd
containers-common
coreutils
cri-o
crictl
cronie
cryptsetup
ctags
curl
dav1d
db
dbus
dbus-glib
dconf
desktop-file-utils
device-mapper
dhcpcd
dialog
diffutils
djvulibre
dkms
dmidecode
dmraid
dnssec-anchors
docker
dosfstools
double-conversion
e2fsprogs
efibootmgr
efivar
egl-wayland
eglexternalplatform
electron
electron11
elfutils
elinks
ell
emacs
enchant
ethtool
evince
exiv2
expat
faad2
fakeroot
fasd
fcitx
fcitx-configtool
fcitx-googlepinyin
fd
feh
fetchmail
ffmpeg
fftw
figlet
file
filesystem
findutils
fish
flac
flameshot
flex
fmt
fontconfig
freetype2
frei0r-plugins
fribidi
fuse-common
fuse2
fuse3
fzf
gavl
gawk
gc
gcc
gcc-libs
gconf
gcr
gd
gdbm
gdk-pixbuf2
gegl
geoip
geoip-database
gettext
ghc-libs
ghostscript
giflib
gimp
girara
git
gjs
glib-networking
glib2
glibc
glibmm
glslang
glu
gmp
gn
gnome-desktop
gnupg
gnuplot
gnutls
go
go-md2man
gobject-introspection-runtime
google-chrome
gpgme
gpm
gpointing-device-settings
gptfdisk
granite
graphene
graphite
graphviz
grep
groff
grub
gsasl
gsettings-desktop-schemas
gsfonts
gsm
gspell
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtk-update-icon-cache
gtk2
gtk3
gts
guile
gumbo-parser
gvfs
gzip
harfbuzz
harfbuzz-icu
haskell-adjunctions
haskell-aeson
haskell-aeson-pretty
haskell-ansi-terminal
haskell-appar
haskell-asn1-encoding
haskell-asn1-parse
haskell-asn1-types
haskell-assoc
haskell-async
haskell-attoparsec
haskell-base-compat
haskell-base-compat-batteries
haskell-base-orphans
haskell-base16-bytestring
haskell-base64-bytestring
haskell-basement
haskell-basic-prelude
haskell-bifunctors
haskell-blaze-builder
haskell-blaze-html
haskell-blaze-markup
haskell-brick
haskell-byteable
haskell-byteorder
haskell-call-stack
haskell-case-insensitive
haskell-cereal
haskell-chunked-data
haskell-citeproc
haskell-classy-prelude
haskell-cmdargs
haskell-colour
haskell-commonmark
haskell-commonmark-extensions
haskell-commonmark-pandoc
haskell-comonad
haskell-conduit
haskell-conduit-extra
haskell-config-ini
haskell-connection
haskell-contravariant
haskell-cookie
haskell-cryptonite
haskell-data-clist
haskell-data-default
haskell-data-default-class
haskell-data-default-instances-containers
haskell-data-default-instances-dlist
haskell-data-default-instances-old-locale
haskell-data-fix
haskell-digest
haskell-distributive
haskell-dlist
haskell-dlist-instances
haskell-doclayout
haskell-doctemplates
haskell-emojis
haskell-erf
haskell-errors
haskell-file-embed
haskell-fold-debounce
haskell-free
haskell-glob
haskell-haddock-library
haskell-hashable
haskell-hourglass
haskell-hslua
haskell-hslua-module-path
haskell-hslua-module-system
haskell-hslua-module-text
haskell-hsyaml
haskell-http
haskell-http-client
haskell-http-client-tls
haskell-http-conduit
haskell-http-types
haskell-indexed-traversable
haskell-indexed-traversable-instances
haskell-integer-logarithms
haskell-invariant
haskell-iproute
haskell-ipynb
haskell-jira-wiki-markup
haskell-juicypixels
haskell-kan-extensions
haskell-keys
haskell-lens
haskell-megaparsec
haskell-memory
haskell-microlens
haskell-microlens-mtl
haskell-microlens-th
haskell-mime-types
haskell-mono-traversable
haskell-mono-traversable-instances
haskell-mutable-containers
haskell-network
haskell-network-uri
haskell-old-locale
haskell-old-time
haskell-pandoc-types
haskell-parallel
haskell-parser-combinators
haskell-pem
haskell-pointed
haskell-primitive
haskell-profunctors
haskell-quickcheck
haskell-random
haskell-reflection
haskell-resourcet
haskell-safe
haskell-say
haskell-scientific
haskell-semigroupoids
haskell-semigroups
haskell-sha
haskell-skylighting
haskell-skylighting-core
haskell-socks
haskell-split
haskell-splitmix
haskell-statevar
haskell-stm-chans
haskell-stm-delay
haskell-streaming-commons
haskell-strict
haskell-syb
haskell-tagged
haskell-tagsoup
haskell-temporary
haskell-texmath
haskell-text-conversions
haskell-text-icu
haskell-text-zipper
haskell-th-abstraction
haskell-th-compat
haskell-th-lift
haskell-th-lift-instances
haskell-these
haskell-time-compat
haskell-tls
haskell-transformers-base
haskell-transformers-compat
haskell-typed-process
haskell-tz
haskell-tzdata
haskell-unicode-collation
haskell-unicode-transforms
haskell-uniplate
haskell-unliftio
haskell-unliftio-core
haskell-unordered-containers
haskell-utf8-string
haskell-uuid-types
haskell-vector
haskell-vector-algorithms
haskell-vector-instances
haskell-void
haskell-vty
haskell-word-wrap
haskell-x509
haskell-x509-store
haskell-x509-system
haskell-x509-validation
haskell-xml
haskell-xml-conduit
haskell-xml-types
haskell-zip-archive
haskell-zlib
hdparm
helm
hicolor-icon-theme
hidapi
highlight
htop
http-parser
httpie
hunspell
hwids
hwloc
hyphen
iana-etc
icu
id3lib
ijs
imath
imlib2
inetutils
iniparser
intel-ucode
inxi
iproute2
iptables-nft
iputils
iso-codes
iw
iwd
jack
jansson
jasper
java-runtime-common
jbig2dec
jemalloc
jq
jre-openjdk
jre-openjdk-headless
js78
json-c
json-glib
julia
karchive
kauth
kbd
kbookmarks
kcodecs
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kded
keyutils
kglobalaccel
kguiaddons
ki18n
kiconthemes
kio
kitemviews
kjobwidgets
kmod
knotifications
krb5
kservice
ktextwidgets
kube-apiserver
kube-controller-manager
kube-proxy
kube-scheduler
kubeadm
kubectl
kubelet
kwallet
kwave
kwayland
kwidgetsaddons
kwindowsystem
kxmlgui
l-smash
ladspa
lame
lapack
lazygit
lcms2
ldb
ldns
lensfun
less
lib32-alsa-lib
lib32-alsa-plugins
lib32-amdvlk
lib32-bzip2
lib32-curl
lib32-e2fsprogs
lib32-expat
lib32-gcc-libs
lib32-glibc
lib32-icu
lib32-keyutils
lib32-krb5
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libpciaccess
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libunistring
lib32-libunwind
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxdamage
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nspr
lib32-nss
lib32-openssl
lib32-p11-kit
lib32-readline
lib32-sqlite
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libabw
libaio
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libblockdev
libbluray
libbsd
libbytesize
libcanberra
libcap
libcap-ng
libcddb
libcdio
libcdio-paranoia
libcdr
libcerf
libcloudproviders
libcmis
libcolord
libconfig
libcroco
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdca
libde265
libdiscid
libdrm
libdvbpsi
libe-book
libebml
libebur128
libedit
libelf
libepoxy
libepubgen
libetonyek
libev
libevdev
libevent
libexif
libexttextcat
libffi
libfontenc
libfprint
libfreehand
libgcrypt
libgee
libgexiv2
libgit2
libglvnd
libgnomekbd
libgooglepinyin
libgpg-error
libgudev
libgusb
libgxps
libhandy
libheif
libibus
libical
libice
libid3tag
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libindicator-gtk3
libinih
libinput
libixion
libjpeg-turbo
libkeybinder3
libksba
liblangtag
libldap
liblqr
libluv
libmad
libmanette
libmatroska
libmaxminddb
libmfx
libmicrohttpd
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmpcdec
libmpeg2
libmspub
libmupdf
libmwaw
libmypaint
libndp
libnet
libnetfilter_conntrack
libnetfilter_cthelper
libnetfilter_cttimeout
libnetfilter_queue
libnewt
libnfnetlink
libnftnl
libnghttp2
libnl
libnm
libnotify
libnsl
libnumbertext
libodfgen
libogg
libomxil-bellagio
liborcus
libotf
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libplacebo
libplist
libpng
libproxy
libpsl
libpulse
libqxp
libraqm
libraw
libraw1394
libreoffice-still
librevenge
librsvg
libsamplerate
libsasl
libseccomp
libsecret
libsigc++
libsigsegv
libsm
libsndfile
libsodium
libsoup
libsoxr
libspectre
libspiro
libssh
libssh2
libstaroffice
libsynctex
libtar
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libunistring
libunwind
libupnp
liburing
libusb
libusbmuxd
libutempter
libutf8proc
libuv
libva
libvdpau
libvisio
libvisual
libvorbis
libvpx
libvterm
libwacom
libwebp
libwmf
libwpd
libwpe
libwpg
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmu
libxpm
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxvmc
libxxf86vm
libyaml
libyuv
libzmf
licenses
linux
linux-api-headers
linux-firmware
linux-lts-headers
llvm-libs
lm_sensors
lmdb
lpsolve
lsb-release
lsof
lua
lua51
lua52
lua53
luajit
lvm2
lz4
lzo
m17n-db
m17n-lib
m4
mailcap
make
man-db
mariadb
mariadb-clients
mariadb-libs
mbedtls
md4c
mdadm
media-player-info
mesa
metasploit
metis
minikube
minizip
mkinitcpio
mkinitcpio-busybox
mlt
mobile-broadband-provider-info
mongodb-bin
mongodb-tools-bin
movit
mpfr
msgpack-c
msmtp
mtdev
mutt
mypaint-brushes1
ncurses
ndctl
neon
neovim
nerd-fonts-dejavu-complete
net-tools
netctl
netease-cloud-music
netpbm
nettle
networkmanager
newsboat
nftables
nginx
ninja
node-gyp
nodejs
noto-fonts-cjk
npm
npth
nspr
nss
ntfs-3g
nvidia
nvidia-utils
oath-toolkit
oniguruma
openal
openblas
opencore-amr
openexr
openjpeg2
openlibm
openmpi
openresolv
openssh
openssl
openssl-1.0
opus
orc
p11-kit
p7zip
pacman
pacman-mirrorlist
pam
pambase
pandoc
pango
parallel
parted
patch
pciutils
pcre
pcre2
perl
perl-curses
perl-error
perl-mailtools
perl-parse-yapp
perl-text-charwidth
perl-timedate
perl-try-tiny
picom
pikaur
pinentry
pixman
pkgconf
polkit
polkit-qt5
poppler
poppler-data
poppler-glib
popt
postgresql-libs
potrace
procmail
procps-ng
psmisc
pulseaudio
pulseaudio-bluetooth
pyalpm
python
python-appdirs
python-babel
python-cairo
python-chardet
python-dnspython
python-docutils
python-gobject
python-idna
python-imagesize
python-jinja
python-markdown
python-markupsafe
python-more-itertools
python-ordered-set
python-packaging
python-pillow
python-pygments
python-pyparsing
python-pysocks
python-pytz
python-requests
python-requests-toolbelt
python-setuptools
python-six
python-snowballstemmer
python-sphinx
python-sphinx-alabaster-theme
python-sphinx_rtd_theme
python-sphinxcontrib-applehelp
python-sphinxcontrib-devhelp
python-sphinxcontrib-htmlhelp
python-sphinxcontrib-jsmath
python-sphinxcontrib-qthelp
python-sphinxcontrib-serializinghtml
python-urllib3
python2
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-imageformats
qt5-location
qt5-multimedia
qt5-quickcontrols
qt5-quickcontrols2
qt5-sensors
qt5-speech
qt5-svg
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-webkit
qt5-websockets
qt5-x11extras
ranger
raptor
rasqal
rav1e
re2
readline
redland
rest
ripgrep
rsync
rtkit
ruby2.7
run-parts
runc
samba
sbc
sbt
scala
screenfetch
screenkey
sdl
sdl2
sed
semver
shaderc
shadow
shared-mime-info
shotcut
simplescreenrecorder
slack-desktop
slang
smbclient
snappy
socat
solid
sonnet
sound-theme-freedesktop
spandsp
speex
speexdsp
spirv-tools
sqlite
srt
sshpass
steam
stfl
sublime-text-3
sudo
suitesparse
svt-av1
swig
synapse
sysfsutils
systemd
systemd-libs
systemd-sysvcompat
t1lib
taglib
talloc
tar
task
taskd
taskell
tbb
tdb
telegram-desktop
telepathy-glib
termius
termshark
tevent
texinfo
texlive-bin
texlive-core
thin-provisioning-tools
thunderbird
timeshift
timew
tlp
tlp-rdw
tmux
tre
tree
tslib
ttf-arphic-ukai
ttf-arphic-uming
ttf-dejavu
ttf-mac-fonts
ttf-nerd-fonts-symbols
ttf-opensans
typora
tzdata
udisks2
unibilium
unicode-cldr-annotations
unrar
unzip
upower
usbmuxd
usbutils
util-linux
util-linux-libs
v2ray
v2ray-domain-list-community
v2ray-geoip
v4l-utils
vid.stab
vim
vim-runtime
virtualbox
virtualbox-host-modules-arch
visual-studio-code-bin
vit
vlc
vmaf
volume_key
vte-common
vte3
vulkan-icd-loader
w3m
wayland
wayland-protocols
webkit2gtk
webrtc-audio-processing
wechat-uos
weechat
wget
which
wireless_tools
wireshark-cli
woff2
wpa_supplicant
wpebackend-fdo
wqy-bitmapfont
wqy-microhei
wqy-microhei-lite
wqy-zenhei
wxgtk-common
wxgtk3
x264
x265
xapian-core
xapp
xcb-imdkit
xcb-proto
xcb-util
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xclip
xdg-dbus-proxy
xdg-utils
xdotool
xf86-input-evdev
xf86-input-libinput
xf86-input-synaptics
xf86-video-intel
xfsprogs
xkeyboard-config
xmlsec
xorg-bdftopcf
xorg-font-util
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwd
xorg-xwininfo
xorg-xwud
xorgproto
xvidcore
xxhash
xz
you-get
zathura
zathura-pdf-poppler
zeal
zeitgeist
zenity
zeromq
zimg
zip
zita-alsa-pcmi
zita-resampler
zlib
zsh
zsh-autosuggestions
zsh-completions
zsh-syntax-highlighting
zstd
zziplib
